app/controllers/jokes_controller.rb

  def index
    @jokes = Joke.all
---
SELECT "jokes".* FROM "jokes"

  def show
    @joke = Joke.find(params[:id])
---
SELECT "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @joke = Joke.find(params[:id])
---
SELECT "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    @joke = Joke.new(jokes_params)

    if @joke.save
---
INSERT INTO "jokes" ("name", "content", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @joke = Joke.find(params[:id])

    if @joke.update(jokes_params)
---
SELECT "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "jokes" SET "content" = $1, "updated_at" = $2 WHERE "jokes"."id" = $3  [["content", "What kind of math do birds love? Owl-gebra!d"], ["updated_at", "2024-09-29 13:51:10.402989"], ["id", 2]]

  def destroy
    @joke = Joke.find(params[:id])
    @joke.destroy
---
SELECT "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "jokes" WHERE "jokes"."id" = $1  [["id", 1]]